# SQL for Data Science

Prepared by [Yashar Mansouri](www.https://www.linkedin.com/in/yasharmansouri)

The used database and the order of the material is based on Dan Sullivan's [Advanced SQL for Data Science](https://www.linkedin.com/learning/advanced-sql-for-data-scientists) LinkedIn Learning Course.

This is mostly the tuned up version with python implementation and revised queries.

If you entered a wrong query and received an error, mak sure to close connection and open up again:  
- rememeber to change your arguements such as host, database name, password, port

- sql file with table creation and insertion is located in the **data** folder.

```python
cur.close()
conn.close()
conn = psycopg2.connect(host="localhost",database="data_sci", user="postgres", password="password", port=5432)
cur = conn.cursor()
```

## Connection

[PostgresSQL Tutorial](https://www.postgresqltutorial.com/postgresql-python/connect/)

### Import libraries

In [1]:
# !pip install psycopg2
# or
# !conda install psycopg2
# YOU DO YOU!
import psycopg2
import pandas as pd

### Create Connection & Cursor

In [2]:
#change user and password to your settings ☜(ﾟヮﾟ☜)
# port: the port number that defaults to 5432 if it is not provided.
conn = psycopg2.connect(host="localhost",database="data_sci", user="postgres", password="password", port=5432)
cur = conn.cursor()

Code Template:
```python
cur = conn.cursor()
cmd = """SQL DDL/DML cmd"""
cur.execute(cmd)
cur.fetchone() or cur.fetchall()
cur.close()
conn.commit()
conn.close()
```

## Executing cmds

Version Check and Connection

In [3]:
cur.execute("""SELECT version()
            """)
cur.fetchone()

('PostgreSQL 12.2, compiled by Visual C++ build 1914, 64-bit',)

To check whether the cursor or the connection is connected:

In [4]:
conn is None and cur is None
#False

False

In [5]:
cur

In [6]:
conn

## Show Tables using PostgreSQL

This line comes from the PostgreSQL Tutorials:

If you are coming from MySQL, you may miss the SHOW TABLES statement that displays all tables in a specific database. PostgreSQL does not provide the SHOW TABLES statement directly but give you something similar ¯\_(ツ)_/¯.

In [7]:
cmd = """SELECT
         *
         FROM
         pg_catalog.pg_tables
         WHERE
         schemaname != 'pg_catalog'
         AND schemaname != 'information_schema';"""
cur.execute(cmd)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

,schemaname,tablename,tableowner,tablespace,hasindexes,hasrules,hastriggers,rowsecurity
0,public,company_divisions,postgres,None,True,False,False,False
1,public,company_regions,postgres,None,True,False,False,False
2,public,staff,postgres,None,True,False,False,False

### Getting Column Names Trick:

In [8]:
print(cur.description)
print('😎'*30)
print(cur.description[0])
print('🙄'*30)
print(cur.description[0][0], cur.description[1][0], cur.description[2][0], cur.description[3][0], cur.description[4][0], cur.description[5][0], cur.description[6][0], cur.description[7][0])
print('🤯'*30)
print([col[0] for col in cur.description])

(Column(name='schemaname', type_code=19), Column(name='tablename', type_code=19), Column(name='tableowner', type_code=19), Column(name='tablespace', type_code=19), Column(name='hasindexes', type_code=16), Column(name='hasrules', type_code=16), Column(name='hastriggers', type_code=16), Column(name='rowsecurity', type_code=16))
😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎😎
Column(name='schemaname', type_code=19)
🙄🙄🙄🙄🙄🙄🙄🙄🙄🙄🙄🙄🙄🙄🙄🙄🙄🙄🙄🙄🙄🙄🙄🙄🙄🙄🙄🙄🙄🙄
schemaname tablename tableowner tablespace hasindexes hasrules hastriggers rowsecurity
🤯🤯🤯🤯🤯🤯🤯🤯🤯🤯🤯🤯🤯🤯🤯🤯🤯🤯🤯🤯🤯🤯🤯🤯🤯🤯🤯🤯🤯🤯
['schemaname', 'tablename', 'tableowner', 'tablespace', 'hasindexes', 'hasrules', 'hastriggers', 'rowsecurity']

In [9]:
cur.description[0]

Column(name='schemaname', type_code=19)

## Checking the Tables

In [10]:
cmd = """SELECT * FROM company_divisions;"""
cur.execute(cmd)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

     department      company_division
0    Automotive       Auto & Hardware
1          Baby              Domestic
2        Beauty              Domestic
3      Clothing              Domestic
4     Computers  Electronic Equipment
5   Electronics  Electronic Equipment
6         Games              Domestic
7        Garden     Outdoors & Garden
8       Grocery              Domestic
9        Health              Domestic
10         Home              Domestic
11   Industrial       Auto & Hardware
12     Jewelery               Fashion
13         Kids              Domestic
14       Movies         Entertainment
15        Music         Entertainment
16     Outdoors     Outdoors & Garden
17        Shoes              Domestic
18       Sports        Games & Sports
19        Tools       Auto & Hardware
20         Toys        Games & Sports

In [11]:
cmd = """SELECT * FROM company_regions;"""
cur.execute(cmd)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

   region_id   company_regions country
0          1         Northeast     USA
1          2         Southeast     USA
2          3         Northwest     USA
3          4         Southwest     USA
4          5  British Columbia  Canada
5          6            Quebec  Canada
6          7       Nova Scotia  Canada

In [12]:
cmd = """SELECT * FROM staff;"""
cur.execute(cmd)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

,id,last_name,email,gender,department,start_date,salary,job_title,region_id
0,1,Kelley,rkelley0@soundcloud.com,Female,Computers,2009-10-02,67470,Structural Engineer,2
1,2,Armstrong,sarmstrong1@infoseek.co.jp,Male,Sports,2008-03-31,71869,Financial Advisor,2
2,3,Carr,fcarr2@woothemes.com,Male,Automotive,2009-07-12,101768,Recruiting Manager,3
3,4,Murray,jmurray3@gov.uk,Female,Jewelery,2014-12-25,96897,Desktop Support Technician,3
4,5,Ellis,jellis4@sciencedirect.com,Female,Grocery,2002-09-19,63702,Software Engineer III,7
...,...,...,...,...,...,...,...,...,...
995,996,James,tjamesrn@soundcloud.com,Female,Games,2013-11-17,78433,Accountant II,7
996,997,Reynolds,dreynoldsro@blogtalkradio.com,Female,Computers,2007-04-16,120138,Statistician IV,1
997,998,Walker,kwalkerrp@unicef.org,Female,Games,2010-02-13,60363,Account Coordinator,1
998,999,Kennedy,lkennedyrq@edublogs.org,Male,Industrial,2004-09-22,48050,Graphic Designer,2
999,1000,Howard,showardrr@addtoany.com,Male,Baby,2003-11-07,148687,General Manager,3

# COUNT

In [13]:
cmd = """SELECT gender, COUNT(gender) FROM staff
         GROUP BY gender;"""
cur.execute(cmd)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

   gender  count
0  Female    496
1    Male    504

# MIN, MAX

In [14]:
cmd = """SELECT department, gender, MIN(salary), MAX(salary) FROM staff
         GROUP BY department, gender
         ORDER BY department, gender;"""
cur.execute(cmd)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

#Pretty Cool huh! ☜(ﾟヮﾟ☜)

     department  gender    min     max
0    Automotive  Female  42602  136448
1    Automotive    Male  44377  146167
2          Baby  Female  50448  141464
3          Baby    Male  42924  148687
4        Beauty  Female  41299  143853
5        Beauty    Male  40254  149099
6         Books  Female  47131  145284
7         Books    Male  42714  146745
8      Clothing  Female  42797  148408
9      Clothing    Male  43067  130188
10    Computers  Female  46960  149336
11    Computers    Male  47541  139304
12  Electronics  Female  41697  149597
13  Electronics    Male  40218  144073
14        Games  Female  42347  149221
15        Games    Male  41516  145575
16       Garden  Female  51792  148860
17       Garden    Male  50057  144965
18      Grocery  Female  45486  149929
19      Grocery    Male  44919  148993
20       Health  Female  43431  145962
21       Health    Male  43986  142967
22         Home  Female  40415  149598
23         Home    Male  44593  146432
24   Industrial  Female  54876  140850
25   Industrial    Male  40194  148816
26     Jewelery  Female  46653  145281
27     Jewelery    Male  41026  149114
28         Kids  Female  43097  149351
29         Kids    Male  44093  139163
30       Movies  Female  51132  142840
31       Movies    Male  41898  146970
32        Music  Female  42759  144608
33        Music    Male  43940  138540
34     Outdoors  Female  43366  148906
35     Outdoors    Male  46072  144932
36        Shoes  Female  52041  147739
37        Shoes    Male  45463  140243
38       Sports  Female  52792  146611
39       Sports    Male  40418  147166
40        Tools  Female  44788  149586
41        Tools    Male  47271  144661
42         Toys  Female  40138  144991
43         Toys    Male  41855  149835

# Sum, Average, Variance, Standard Deviation

In [15]:
cmd = """SELECT 
         department, 
         SUM(salary) AS total_salary, 
         AVG(salary) AS average_salary,
         VAR_POP(salary) AS variance_salary,
         STDDEV_POP(salary) AS standard_deviation_salary 
         FROM staff
         GROUP BY department
         ORDER BY total_salary;"""
cur.execute(cmd)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

,department,total_salary,average_salary,variance_salary,standard_deviation_salary
0,Music,3274767,88507.216216216216,1001696601.52081812,31649.59085866
1,Kids,3543027,93237.552631578947,1072987422.93144044,32756.48673059
2,Movies,3632825,100911.805555555556,876898879.10108025,29612.47843564
3,Sports,3756041,93901.025000000000,1049150239.87437500,32390.58875467
4,Toys,3943674,96187.170731707317,1150709491.31231410,33922.10918136
5,Shoes,3968118,92281.813953488372,849306565.17468902,29142.86473864
6,Jewelery,4039362,87812.217391304348,875256537.77882798,29584.73487762
7,Tools,4095808,105020.717948717949,795868561.02301118,28211.14249766
8,Baby,4218724,93749.422222222222,912220932.82172840,30202.99542797
9,Industrial,4366340,92900.851063829787,889271955.27569036,29820.66322662
10,Books,4459837,94890.148936170213,945765035.82888185,30753.29308918
11,Electronics,4489141,91615.122448979592,1073778518.02582257,32768.55990162
12,Health,4552880,98975.652173913043,1216304238.79206049,34875.55359836
13,Automotive,4584268,99658.000000000000,929902811.86956522,30494.30786015
14,Grocery,4651241,101113.934782608696,1161021316.10444234,34073.76286976
15,Garden,4792085,101959.255319148936,909562157.08374830,30158.94820918
16,Home,4822205,92734.711538461538,1037243300.97448225,32206.26182863
17,Clothing,5037890,95054.528301886792,1000324590.36240655,31627.90840954
18,Games,5090304,103883.755102040816,1040425239.16451479,32255.62337275
19,Computers,5152963,99095.442307692308,930175201.51590237,30498.77377069
20,Outdoors,5378660,112055.416666666667,745849798.45138889,27310.25079437
21,Beauty,5481063,103416.283018867925,952478558.54254183,30862.25135246

# ROUND, TRUNC, CEIL
- ROUND() rounds the number to the n decimal point, or if n is not decalred then it rounds to the closest integer.  
- TRUNC() just gets rid of the decimals, if n is delared for TRUNC, then the remaining decimals gets dropped  
- CEIL() rounds the number up to the next integer

In [16]:
# n = 2 in this case

cmd = """SELECT 
         department, 
         SUM(salary) AS total_salary, 
         ROUND(AVG(salary),2) AS average_salary_round_2decimals,
         ROUND(AVG(salary)) AS average_salary_round,
         TRUNC(AVG(salary)) AS average_salary_truncated,
         CEIL(AVG(salary)) AS average_salary_ceiling 
         FROM staff
         GROUP BY department
         ORDER BY total_salary;"""
cur.execute(cmd)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

,department,total_salary,average_salary_round_2decimals,average_salary_round,average_salary_truncated,average_salary_ceiling
0,Music,3274767,88507.22,88507,88507,88508
1,Kids,3543027,93237.55,93238,93237,93238
2,Movies,3632825,100911.81,100912,100911,100912
3,Sports,3756041,93901.03,93901,93901,93902
4,Toys,3943674,96187.17,96187,96187,96188
5,Shoes,3968118,92281.81,92282,92281,92282
6,Jewelery,4039362,87812.22,87812,87812,87813
7,Tools,4095808,105020.72,105021,105020,105021
8,Baby,4218724,93749.42,93749,93749,93750
9,Industrial,4366340,92900.85,92901,92900,92901
10,Books,4459837,94890.15,94890,94890,94891
11,Electronics,4489141,91615.12,91615,91615,91616
12,Health,4552880,98975.65,98976,98975,98976
13,Automotive,4584268,99658.00,99658,99658,99658
14,Grocery,4651241,101113.93,101114,101113,101114
15,Garden,4792085,101959.26,101959,101959,101960
16,Home,4822205,92734.71,92735,92734,92735
17,Clothing,5037890,95054.53,95055,95054,95055
18,Games,5090304,103883.76,103884,103883,103884
19,Computers,5152963,99095.44,99095,99095,99096
20,Outdoors,5378660,112055.42,112055,112055,112056
21,Beauty,5481063,103416.28,103416,103416,103417

# Filtering & Joining

In [17]:
cmd = """SELECT *
         FROM staff
         INNER JOIN company_regions
         USING (region_id)
         INNER JOIN company_divisions
         USING (department)
         WHERE company_division IN ('Electronic Equipment', 'Games & Sports')
         AND
         department = 'Electronics'
         AND
         last_name ILIKE 's%'"""
cur.execute(cmd)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

,department,region_id,id,last_name,email,gender,start_date,salary,job_title,company_regions,country,company_division
0,Electronics,1,985,Stevens,hstevensrc@hugedomains.com,Male,2006-02-28,118791,Safety Technician IV,Northeast,USA,Electronic Equipment
1,Electronics,1,906,Spencer,sspencerp5@mtv.com,Male,2014-04-18,110881,Electrical Engineer,Northeast,USA,Electronic Equipment
2,Electronics,2,679,Stone,pstoneiu@narod.ru,Male,2014-05-15,40218,Paralegal,Southeast,USA,Electronic Equipment
3,Electronics,7,762,Stanley,cstanleyl5@springer.com,Male,2013-08-09,103237,Account Executive,Nova Scotia,Canada,Electronic Equipment

In [18]:
#if the joining column names are not the same then:

cmd = """SELECT *
             FROM staff s
             INNER JOIN company_regions cr
             ON cr.region_id=s.region_id
             INNER JOIN company_divisions cd
             ON s.department=cd.department
             WHERE company_division IN ('Electronic Equipment', 'Games & Sports')
	         AND
	         s.department = 'Electronics'
	         AND
	         last_name ILIKE 's%'"""
cur.execute(cmd)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

,id,last_name,email,gender,department,start_date,salary,job_title,region_id,region_id,company_regions,country,department,company_division
0,985,Stevens,hstevensrc@hugedomains.com,Male,Electronics,2006-02-28,118791,Safety Technician IV,1,1,Northeast,USA,Electronics,Electronic Equipment
1,906,Spencer,sspencerp5@mtv.com,Male,Electronics,2014-04-18,110881,Electrical Engineer,1,1,Northeast,USA,Electronics,Electronic Equipment
2,679,Stone,pstoneiu@narod.ru,Male,Electronics,2014-05-15,40218,Paralegal,2,2,Southeast,USA,Electronics,Electronic Equipment
3,762,Stanley,cstanleyl5@springer.com,Male,Electronics,2013-08-09,103237,Account Executive,7,7,Nova Scotia,Canada,Electronics,Electronic Equipment

# CONCATENATION, LOWERCASE, UPPERCASE

In [19]:
cmd = """SELECT 
         UPPER(department) || ' ⨀⨀⨀ ' ||LOWER(job_title) fancy_column_name
         FROM staff
         LIMIT 10"""
cur.execute(cmd)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

                         fancy_column_name
0        COMPUTERS ⨀⨀⨀ structural engineer
1             SPORTS ⨀⨀⨀ financial advisor
2        AUTOMOTIVE ⨀⨀⨀ recruiting manager
3  JEWELERY ⨀⨀⨀ desktop support technician
4        GROCERY ⨀⨀⨀ software engineer iii
5            TOOLS ⨀⨀⨀ executive secretary
6           COMPUTERS ⨀⨀⨀ dental hygienist
7             TOYS ⨀⨀⨀ safety technician i
8             JEWELERY ⨀⨀⨀ sales associate
9          MOVIES ⨀⨀⨀ sales representative

In [20]:
cmd = """SELECT 
         CONCAT(UPPER(department), ' (☞ﾟヮﾟ)☞ 2nd method ☜(ﾟヮﾟ☜)', LOWER(job_title)) do_you_even_code_bro
         FROM staff
         LIMIT 10"""
cur.execute(cmd)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

                                do_you_even_code_bro
0  COMPUTERS (☞ﾟヮﾟ)☞ 2nd method ☜(ﾟヮﾟ☜)structural...
1  SPORTS (☞ﾟヮﾟ)☞ 2nd method ☜(ﾟヮﾟ☜)financial adv...
2  AUTOMOTIVE (☞ﾟヮﾟ)☞ 2nd method ☜(ﾟヮﾟ☜)recruitin...
3  JEWELERY (☞ﾟヮﾟ)☞ 2nd method ☜(ﾟヮﾟ☜)desktop sup...
4  GROCERY (☞ﾟヮﾟ)☞ 2nd method ☜(ﾟヮﾟ☜)software eng...
5  TOOLS (☞ﾟヮﾟ)☞ 2nd method ☜(ﾟヮﾟ☜)executive secr...
6  COMPUTERS (☞ﾟヮﾟ)☞ 2nd method ☜(ﾟヮﾟ☜)dental hyg...
7  TOYS (☞ﾟヮﾟ)☞ 2nd method ☜(ﾟヮﾟ☜)safety technici...
8  JEWELERY (☞ﾟヮﾟ)☞ 2nd method ☜(ﾟヮﾟ☜)sales assoc...
9  MOVIES (☞ﾟヮﾟ)☞ 2nd method ☜(ﾟヮﾟ☜)sales represe...

# TRIM, LENGTH, Booleans

[Trim Tutorial](https://www.sqltutorial.org/sql-string-functions/sql-trim/)

In [21]:
cmd = """SELECT 
         TRIM(job_title) veeps, 
         department, LENGTH(department),
         salary,
         (salary > 100000) six_digits_baby
         FROM staff
         WHERE job_title ILIKE '%assist%'
         ORDER BY salary"""
cur.execute(cmd)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

                          veeps  department  length  salary  six_digits_baby
0           Marketing Assistant        Baby       4   42924            False
1          Research Assistant I    Clothing       8   43067            False
2   Administrative Assistant IV    Outdoors       8   43366            False
3    Physical Therapy Assistant      Health       6   43431            False
4           Office Assistant II       Games       5   48064            False
..                          ...         ...     ...     ...              ...
83          Marketing Assistant    Outdoors       8  144932             True
84         Office Assistant III        Toys       4  145559             True
85          Assistant Professor  Automotive      10  146167             True
86        Research Assistant II       Books       5  146701             True
87      Assistant Media Planner       Books       5  146745             True

[88 rows x 5 columns]

# SUBSTRING, OVERLAY  
Both SUBSTRING() and OVERLAY() have the syntax of **FROM** `n` **FOR** `m`

In [22]:
cmd = """SELECT
         OVERLAY(job_title PLACING 'Vice President ' FROM 1 FOR 3) replaced_vp,
         SUBSTRING(job_title FROM 4) vp_position
         FROM staff
         WHERE job_title ILIKE '%VP%'
         ORDER BY salary"""
cur.execute(cmd)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

                          replaced_vp         vp_position
0            Vice President Marketing           Marketing
1   Vice President Product Management  Product Management
2            Vice President Marketing           Marketing
3           Vice President Accounting          Accounting
4      Vice President Quality Control     Quality Control
5                Vice President Sales               Sales
6   Vice President Product Management  Product Management
7   Vice President Product Management  Product Management
8           Vice President Accounting          Accounting
9           Vice President Accounting          Accounting
10           Vice President Marketing           Marketing
11     Vice President Quality Control     Quality Control
12  Vice President Product Management  Product Management
13  Vice President Product Management  Product Management
14     Vice President Quality Control     Quality Control
15               Vice President Sales               Sales
16  Vice President Product Management  Product Management
17          Vice President Accounting          Accounting
18           Vice President Marketing           Marketing
19  Vice President Product Management  Product Management
20          Vice President Accounting          Accounting
21          Vice President Accounting          Accounting
22     Vice President Quality Control     Quality Control
23  Vice President Product Management  Product Management
24          Vice President Accounting          Accounting
25     Vice President Quality Control     Quality Control
26     Vice President Quality Control     Quality Control
27           Vice President Marketing           Marketing
28     Vice President Quality Control     Quality Control
29           Vice President Marketing           Marketing
30           Vice President Marketing           Marketing
31               Vice President Sales               Sales
32     Vice President Quality Control     Quality Control
33               Vice President Sales               Sales
34     Vice President Quality Control     Quality Control
35     Vice President Quality Control     Quality Control
36  Vice President Product Management  Product Management
37     Vice President Quality Control     Quality Control
38          Vice President Accounting          Accounting
39          Vice President Accounting          Accounting
40  Vice President Product Management  Product Management
41               Vice President Sales               Sales
42     Vice President Quality Control     Quality Control
43          Vice President Accounting          Accounting
44          Vice President Accounting          Accounting
45     Vice President Quality Control     Quality Control
46     Vice President Quality Control     Quality Control
47  Vice President Product Management  Product Management

# LIKE, SIMILAR TO
Cool Regex Websites:  
[Regex101](https://regex101.com/)  
[Regexer](https://regexr.com/)

In [23]:
#not the cool way, repetition causes depletion of life energy and then you get fired! (╯°□°）╯︵ ┻━┻)
cmd = """SELECT job_title FROM staff
         WHERE job_title LIKE '%IV%' 
         OR job_title LIKE '%III%' 
         OR job_title LIKE '%II%' 
         OR job_title LIKE '%I%' """
cur.execute(cmd)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

                      job_title
0         Software Engineer III
1           Safety Technician I
2    Software Test Engineer III
3             Web Developer III
4                 Programmer IV
..                          ...
283              Health Coach I
284        Safety Technician IV
285              Accountant III
286               Accountant II
287             Statistician IV

[288 rows x 1 columns]

In [24]:
#all titles having levels at the end with any character before them
#this way has few more computational units as well, yet both of them are 1 loop scans
cmd = """SELECT job_title FROM staff
         WHERE job_title SIMILAR TO '%(I|II|III|IV)%'
         ORDER BY job_title
      """
cur.execute(cmd)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

                     job_title
0     Account Representative I
1     Account Representative I
2     Account Representative I
3     Account Representative I
4    Account Representative II
..                         ...
283          Web Developer III
284          Web Developer III
285          Web Developer III
286           Web Developer IV
287           Web Developer IV

[288 rows x 1 columns]

In [25]:
#only jobs that start with Developer and any words in between and then levels and any words afterwards
cmd = """SELECT job_title FROM staff
             WHERE job_title SIMILAR TO 'Developer%(I|II|III|IV)%'
          """
cur.execute(cmd)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

       job_title
0  Developer III
1   Developer IV
2   Developer IV
3   Developer IV
4   Developer IV
5   Developer II
6  Developer III
7   Developer IV
8    Developer I
9  Developer III

In [26]:
#jobs with any character before developer, any character inbetween, levels, any character afterwards
cmd = """SELECT job_title FROM staff
         WHERE job_title SIMILAR TO '%Developer%(I|II|III|IV)%'
      """
cur.execute(cmd)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

            job_title
0   Web Developer III
1   Web Developer III
2       Developer III
3     Web Developer I
4   Web Developer III
5    Web Developer II
6        Developer IV
7        Developer IV
8    Web Developer II
9     Web Developer I
10    Web Developer I
11       Developer IV
12   Web Developer IV
13       Developer IV
14  Web Developer III
15  Web Developer III
16    Web Developer I
17       Developer II
18      Developer III
19       Developer IV
20        Developer I
21      Developer III
22    Web Developer I
23   Web Developer IV

In [27]:
# any word that starts with letters L or O or V or E ಥ_ಥ
cmd = """SELECT job_title FROM staff
         WHERE job_title SIMILAR TO '[LOVE]%'
      """
cur.execute(cmd)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

               job_title
0    Executive Secretary
1               VP Sales
2     VP Quality Control
3    Executive Secretary
4              Librarian
..                   ...
150         Engineer III
151      Legal Assistant
152               Editor
153   Environmental Tech
154            Librarian

[155 rows x 1 columns]

In [28]:
#any word that starts from the range of A to F
cmd = """SELECT job_title FROM staff
         WHERE job_title SIMILAR TO '[A-F]%'
         ORDER BY job_title
      """
cur.execute(cmd)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

               job_title
0    Account Coordinator
1    Account Coordinator
2    Account Coordinator
3    Account Coordinator
4    Account Coordinator
..                   ...
366         Food Chemist
367         Food Chemist
368         Food Chemist
369         Food Chemist
370         Food Chemist

[371 rows x 1 columns]

## Cases

In [29]:
cmd = """SELECT job_title, 
         CASE WHEN job_title SIMILAR TO '%IV' THEN 'IV'
	     WHEN job_title SIMILAR TO '%III' THEN 'III'
	     WHEN job_title SIMILAR TO '%II' THEN 'II'
	     WHEN job_title SIMILAR TO '%I' THEN 'I'
         END AS levels
         FROM staff
         WHERE job_title SIMILAR TO '(%I|II|III|IV)'
         ORDER BY job_title"""
cur.execute(cmd)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

                     job_title levels
0     Account Representative I      I
1     Account Representative I      I
2     Account Representative I      I
3     Account Representative I      I
4    Account Representative II     II
..                         ...    ...
193          Web Developer III    III
194          Web Developer III    III
195          Web Developer III    III
196          Web Developer III    III
197          Web Developer III    III

[198 rows x 2 columns]

# Subqueries

## SELECT Clause Subquery (New Column)

In [30]:
#getting the per department average for each employee( •_•)>⌐■-■
cmd = """SELECT 
         s1.last_name,
         s1.job_title, 
         s1.salary, 
         s1.department, 
         (SELECT ROUND(AVG(SALARY)) FROM staff s2 WHERE s2.department =                s1.department)
         FROM staff s1
         ORDER BY s1.department, s1.salary
      """
cur.execute(cmd)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

    last_name                      job_title  salary  department  round
0       Meyer                  Programmer IV   42602  Automotive  99658
1       Burns               Technical Writer   44377  Automotive  99658
2      Duncan            Electrical Engineer   45774  Automotive  99658
3    Marshall                       VP Sales   47281  Automotive  99658
4    Peterson                     Pharmacist   53964  Automotive  99658
..        ...                            ...     ...         ...    ...
995    Hansen           Office Assistant III  145559        Toys  96187
996    Holmes  Analog Circuit Design manager  147150        Toys  96187
997   Ramirez              Chemical Engineer  147862        Toys  96187
998   Stewart                Data Coordiator  148144        Toys  96187
999    Greene                  Geologist III  149835        Toys  96187

[1000 rows x 5 columns]

## FROM Clause Subquery

In [31]:
#standard_deviation of salaries lower than 50k per department
cmd ="""SELECT s1.department, 
        ROUND(STDDEV(s1.salary),2) standard_deviation_salary_lower_50k
        FROM (SELECT department, salary FROM staff
        WHERE salary < 50000)s1
        GROUP BY s1.department
     """ 
cur.execute(cmd)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

     department standard_deviation_salary_lower_50k
0         Tools                             1755.75
1   Electronics                             3029.66
2        Sports                             5935.45
3         Books                             2229.88
4      Clothing                              732.50
5          Kids                             3043.24
6         Music                             3127.45
7    Automotive                             1995.02
8      Outdoors                             1913.43
9          Toys                             2686.47
10   Industrial                             4260.74
11       Health                             2437.21
12      Grocery                              342.06
13       Movies                             4281.94
14     Jewelery                             3258.09
15         Home                             3003.46
16         Baby                             3460.07
17        Shoes                             2380.12
18        Games                             3564.90
19       Beauty                             4360.02
20    Computers                             1124.72

## WHERE Clause Subquery

In [32]:
#selecting employees where their salary is between the average salary of the Toys department and 110k

cmd = """SELECT last_name, job_title, department, salary
         FROM staff
         WHERE salary 
         BETWEEN
         (SELECT AVG(salary) FROM staff
         WHERE department='Toys'
         GROUP BY department) 
         AND 110000
         ORDER BY salary
      """
cur.execute(cmd)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

      last_name                    job_title   department  salary
0         Price             Graphic Designer         Baby   96388
1         Mason       Accounting Assistant I       Beauty   96673
2          Cole             Product Engineer       Sports   96739
3          Ruiz    Database Administrator II     Outdoors   96782
4        Murray   Desktop Support Technician     Jewelery   96897
..          ...                          ...          ...     ...
104      Wright  Mechanical Systems Engineer        Shoes  109233
105        Cook        Chief Design Engineer        Music  109404
106      Gibson                  Engineer II    Computers  109449
107  Washington           VP Quality Control         Kids  109828
108         Day                     VP Sales  Electronics  109890

[109 rows x 4 columns]

# Joins

In [33]:
#we can use USING(shared_column_name) when the column names are the same
cmd = """SELECT *
         FROM staff
         LEFT JOIN company_divisions
         USING (department)
         LEFT JOIN company_regions
         USING (region_id)
         ORDER BY country, company_regions
      """
cur.execute(cmd)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

,region_id,department,id,last_name,email,gender,start_date,salary,job_title,company_division,company_regions,country
0,5,Shoes,637,Knight,dknightho@buzzfeed.com,Female,2007-07-25,84549,Senior Cost Accountant,Domestic,British Columbia,Canada
1,5,Grocery,290,Carter,scarter81@cargocollective.com,Male,2007-02-09,120800,Accountant III,Domestic,British Columbia,Canada
2,5,Outdoors,630,Pierce,spiercehh@google.nl,Male,2002-02-09,96107,Actuary,Outdoors & Garden,British Columbia,Canada
3,5,Jewelery,628,Diaz,rdiazhf@nih.gov,Male,2008-08-11,65110,Compensation Analyst,Fashion,British Columbia,Canada
4,5,Industrial,895,Moore,kmooreou@slate.com,Male,2014-02-23,40194,Environmental Specialist,Auto & Hardware,British Columbia,Canada
...,...,...,...,...,...,...,...,...,...,...,...,...
995,4,Baby,827,Fowler,hfowlermy@nps.gov,Male,2009-05-07,110383,Chief Design Engineer,Domestic,Southwest,USA
996,4,Garden,693,Carr,hcarrj8@latimes.com,Male,2005-01-17,143570,Actuary,Outdoors & Garden,Southwest,USA
997,4,Books,472,Arnold,larnoldd3@webeden.co.uk,Female,2012-02-25,133781,Office Assistant I,None,Southwest,USA
998,4,Computers,140,Wheeler,bwheeler3v@google.co.uk,Male,2001-01-22,82358,Information Systems Manager,Electronic Equipment,Southwest,USA
999,4,Music,690,Perkins,rperkinsj5@ehow.com,Male,2000-05-09,57988,Web Developer I,Entertainment,Southwest,USA

# Creating Views

Views can help us preserve the tables we created and additionally save us processing power and cause less strain on the server.

In [34]:
#instead of typing the same command for the upper table we can create view:
#CREATE OR REPLACE makes sure the table gets overwritten if it already exists use it wisely
#if table already exists and you try to create with same name, you get error.
cmd = """CREATE OR REPLACE VIEW staff_div_reg AS
         SELECT *
         FROM staff
         LEFT JOIN company_divisions
         USING (department)
         LEFT JOIN company_regions
         USING (region_id)
         ORDER BY country, company_regions
      """
cur.execute(cmd)
conn.commit()

In [35]:
cmd = """SELECT * FROM staff_div_reg"""
cur.execute(cmd)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

,region_id,department,id,last_name,email,gender,start_date,salary,job_title,company_division,company_regions,country
0,5,Shoes,637,Knight,dknightho@buzzfeed.com,Female,2007-07-25,84549,Senior Cost Accountant,Domestic,British Columbia,Canada
1,5,Grocery,290,Carter,scarter81@cargocollective.com,Male,2007-02-09,120800,Accountant III,Domestic,British Columbia,Canada
2,5,Outdoors,630,Pierce,spiercehh@google.nl,Male,2002-02-09,96107,Actuary,Outdoors & Garden,British Columbia,Canada
3,5,Jewelery,628,Diaz,rdiazhf@nih.gov,Male,2008-08-11,65110,Compensation Analyst,Fashion,British Columbia,Canada
4,5,Industrial,895,Moore,kmooreou@slate.com,Male,2014-02-23,40194,Environmental Specialist,Auto & Hardware,British Columbia,Canada
...,...,...,...,...,...,...,...,...,...,...,...,...
995,4,Baby,827,Fowler,hfowlermy@nps.gov,Male,2009-05-07,110383,Chief Design Engineer,Domestic,Southwest,USA
996,4,Garden,693,Carr,hcarrj8@latimes.com,Male,2005-01-17,143570,Actuary,Outdoors & Garden,Southwest,USA
997,4,Books,472,Arnold,larnoldd3@webeden.co.uk,Female,2012-02-25,133781,Office Assistant I,None,Southwest,USA
998,4,Computers,140,Wheeler,bwheeler3v@google.co.uk,Male,2001-01-22,82358,Information Systems Manager,Electronic Equipment,Southwest,USA
999,4,Music,690,Perkins,rperkinsj5@ehow.com,Male,2000-05-09,57988,Web Developer I,Entertainment,Southwest,USA

In [36]:
#count of employee genders per company_regions
cmd = """SELECT country, company_regions, COUNT(*), gender, ROUND(AVG(salary),2) avg_salary
         FROM staff_div_reg
         GROUP BY country, company_regions, gender
         ORDER BY country, company_regions
      """
cur.execute(cmd)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

   country   company_regions  count  gender avg_salary
0   Canada  British Columbia     72    Male   95605.78
1   Canada  British Columbia     57  Female   95677.95
2   Canada       Nova Scotia     76    Male   97003.25
3   Canada       Nova Scotia     83  Female  101421.61
4   Canada            Quebec     66    Male   98259.64
5   Canada            Quebec     51  Female   95084.75
6      USA         Northeast     67    Male   95078.01
7      USA         Northeast     77  Female   99341.40
8      USA         Northwest     67  Female   97732.54
9      USA         Northwest     62    Male   96546.98
10     USA         Southeast     82    Male   94350.26
11     USA         Southeast     72  Female   93156.57
12     USA         Southwest     89  Female   98939.35
13     USA         Southwest     79    Male  102103.30

# Grouping & Totaling

## GROUPING SETS
This will allows us to get breakdown per any group we want.   
Gender Equality Breakdown: (⌐■_■)

In [37]:
cmd = """SELECT
         country, company_division, company_regions, gender, COUNT(*), ROUND(AVG(salary),2) avg_salary
         FROM staff_div_reg
         GROUP BY gender, GROUPING SETS (country, company_division, company_regions)
         ORDER BY country, company_regions, company_division, gender;
   """
cur.execute(cmd)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)
#the last two rows with nulls are because the books department didn't have any division named, hence the nulls. nvm¯\_(ツ)_/¯.

   country      company_division   company_regions  gender  count avg_salary
0   Canada                  None              None  Female    191   98015.49
1   Canada                  None              None    Male    214   96920.56
2      USA                  None              None  Female    305   97410.63
3      USA                  None              None    Male    290   97100.08
4     None                  None  British Columbia  Female     57   95677.95
5     None                  None  British Columbia    Male     72   95605.78
6     None                  None         Northeast  Female     77   99341.40
7     None                  None         Northeast    Male     67   95078.01
8     None                  None         Northwest  Female     67   97732.54
9     None                  None         Northwest    Male     62   96546.98
10    None                  None       Nova Scotia  Female     83  101421.61
11    None                  None       Nova Scotia    Male     76   97003.25
12    None                  None            Quebec  Female     51   95084.75
13    None                  None            Quebec    Male     66   98259.64
14    None                  None         Southeast  Female     72   93156.57
15    None                  None         Southeast    Male     82   94350.26
16    None                  None         Southwest  Female     89   98939.35
17    None                  None         Southwest    Male     79  102103.30
18    None       Auto & Hardware              None  Female     59   99611.46
19    None       Auto & Hardware              None    Male     73   98210.14
20    None              Domestic              None  Female    221   98206.00
21    None              Domestic              None    Male    204   96381.99
22    None  Electronic Equipment              None  Female     49   94066.06
23    None  Electronic Equipment              None    Male     52   96785.90
24    None         Entertainment              None  Female     33   93534.15
25    None         Entertainment              None    Male     40   95524.13
26    None               Fashion              None  Female     20   86788.50
27    None               Fashion              None    Male     26   88599.69
28    None        Games & Sports              None  Female     39   93591.62
29    None        Games & Sports              None    Male     42   96420.05
30    None     Outdoors & Garden              None  Female     51  106586.27
31    None     Outdoors & Garden              None    Male     44  107610.11
32    None                  None              None  Female     24   97208.04
33    None                  None              None    Male     23   92471.48

## ROLLUP: Aggregates in Hierarchy

In [38]:
#compare this normal group by to the ones below
cmd = """SELECT country,company_regions, count(*)
         FROM staff_div_reg
         GROUP BY country, company_regions
         ORDER BY country, company_regions
      """
cur.execute(cmd)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

  country   company_regions  count
0  Canada  British Columbia    129
1  Canada       Nova Scotia    159
2  Canada            Quebec    117
3     USA         Northeast    144
4     USA         Northwest    129
5     USA         Southeast    154
6     USA         Southwest    168

In [39]:
cmd = """SELECT country, company_regions, count(*)
         FROM staff_div_reg
         GROUP BY ROLLUP(country, company_regions)
         ORDER BY country, company_regions
      """
cur.execute(cmd)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

#So in the following table we have the total of all canada regions, all USA regions, and also USA + Canada: So Hierarchical!

  country   company_regions  count
0  Canada  British Columbia    129
1  Canada       Nova Scotia    159
2  Canada            Quebec    117
3  Canada              None    405
4     USA         Northeast    144
5     USA         Northwest    129
6     USA         Southeast    154
7     USA         Southwest    168
8     USA              None    595
9    None              None   1000

## CUBE: All groupings and totals

In [40]:
cmd = """SELECT country, company_regions, ROUND(AVG(salary),2)
         FROM staff_div_reg
         GROUP BY CUBE(country, company_regions)
      """
cur.execute(cmd)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

   country   company_regions      round
0   Canada  British Columbia   95637.67
1   Canada       Nova Scotia   99309.69
2   Canada            Quebec   96875.71
3   Canada              None   97436.93
4      USA         Northeast   97357.74
5      USA         Northwest   97162.74
6      USA         Southeast   93792.17
7      USA         Southwest  100427.16
8      USA              None   97259.27
9     None              None   97331.22
10    None  British Columbia   95637.67
11    None       Nova Scotia   99309.69
12    None         Southeast   93792.17
13    None            Quebec   96875.71
14    None         Northwest   97162.74
15    None         Northeast   97357.74
16    None         Southwest  100427.16

# Window Functions  
Window functions allow us to make SQL statements about rows related to the current row during processing.

## OVER (PARTITION BY . . . )
Helps us to get the same aggregate or result instead of using a new subquery

In [41]:
#compare this one to below:
cmd = """SELECT s1.department, s1.last_name, s1.salary,
         (SELECT ROUND(AVG(salary),2) 
         FROM staff s2 
         WHERE s1.department = s2.department)
         FROM staff s1
         ORDER BY department"""
cur.execute(cmd)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

     department  last_name  salary     round
0    Automotive       Reed  126001  99658.00
1    Automotive      Ortiz   91296  99658.00
2    Automotive   Mcdonald  111041  99658.00
3    Automotive     Torres  120875  99658.00
4    Automotive   Peterson   53964  99658.00
..          ...        ...     ...       ...
995        Toys     Larson  144991  96187.17
996        Toys     Wagner  142516  96187.17
997        Toys    Nichols   43537  96187.17
998        Toys  Alexander  140078  96187.17
999        Toys      Riley   61992  96187.17

[1000 rows x 4 columns]

In [42]:
cmd = """EXPLAIN ANALYZE SELECT s1.department, s1.last_name, s1.salary,
         (SELECT ROUND(AVG(salary),2) 
         FROM staff s2 
         WHERE s1.department = s2.department)
         FROM staff s1
         ORDER BY department"""
cur.execute(cmd)
cols = [x[0] for x in cur.description]
cur.fetchall()

[('Sort  (cost=26701.33..26703.83 rows=1000 width=50) (actual time=112.594..112.623 rows=1000 loops=1)',),
 ('  Sort Key: s1.department',),
 ('  Sort Method: quicksort  Memory: 103kB',),
 ('  ->  Seq Scan on staff s1  (cost=0.00..26651.50 rows=1000 width=50) (actual time=0.511..111.678 rows=1000 loops=1)',),
 ('        SubPlan 1',),
 ('          ->  Aggregate  (cost=26.62..26.63 rows=1 width=32) (actual time=0.111..0.111 rows=1 loops=1000)',),
 ('                ->  Seq Scan on staff s2  (cost=0.00..26.50 rows=45 width=4) (actual time=0.003..0.100 rows=46 loops=1000)',),
 ('                      Filter: ((s1.department)::text = (department)::text)',),
 ('                      Rows Removed by Filter: 954',),
 ('Planning Time: 0.313 ms',),
 ('Execution Time: 112.734 ms',)]

In [43]:
#much shorter, life saver
cmd = """SELECT department, last_name, salary, 
         ROUND(AVG(salary) OVER(PARTITION BY department),2)            average_department_salary
         FROM staff"""
cur.execute(cmd)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

     department  last_name  salary average_department_salary
0    Automotive       Reed  126001                  99658.00
1    Automotive      Ortiz   91296                  99658.00
2    Automotive   Mcdonald  111041                  99658.00
3    Automotive     Torres  120875                  99658.00
4    Automotive   Peterson   53964                  99658.00
..          ...        ...     ...                       ...
995        Toys     Larson  144991                  96187.17
996        Toys     Wagner  142516                  96187.17
997        Toys    Nichols   43537                  96187.17
998        Toys  Alexander  140078                  96187.17
999        Toys      Riley   61992                  96187.17

[1000 rows x 4 columns]

In [44]:
#less computational cost and shorter execution time
cmd = """EXPLAIN ANALYZE SELECT department, last_name, salary,
         ROUND(AVG(salary) OVER(PARTITION BY department),2) average_department_salary
         FROM staff"""
cur.execute(cmd)
cols = [x[0] for x in cur.description]
cur.fetchall()

[('WindowAgg  (cost=73.83..93.83 rows=1000 width=50) (actual time=2.197..3.389 rows=1000 loops=1)',),
 ('  ->  Sort  (cost=73.83..76.33 rows=1000 width=18) (actual time=2.136..2.216 rows=1000 loops=1)',),
 ('        Sort Key: department',),
 ('        Sort Method: quicksort  Memory: 96kB',),
 ('        ->  Seq Scan on staff  (cost=0.00..24.00 rows=1000 width=18) (actual time=0.021..0.290 rows=1000 loops=1)',),
 ('Planning Time: 0.087 ms',),
 ('Execution Time: 3.472 ms',)]

## FIRST_VALUE()

In [45]:
# the following table will give us the comparison of each employee's salary vs the max salary of that department
# this is again both computaionally and time wise more efficient
cmd = """SELECT department, last_name, salary, 
         FIRST_VALUE(salary) OVER (PARTITION BY department ORDER BY salary DESC)
         FROM staff"""
cur.execute(cmd)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

     department  last_name  salary  first_value
0    Automotive    Sanchez  146167       146167
1    Automotive  Alexander  144724       146167
2    Automotive     George  141505       146167
3    Automotive    Edwards  140194       146167
4    Automotive     Gordon  136448       146167
..          ...        ...     ...          ...
995        Toys     Austin   50161       149835
996        Toys    Simpson   46444       149835
997        Toys    Nichols   43537       149835
998        Toys      Adams   41855       149835
999        Toys       Long   40138       149835

[1000 rows x 4 columns]

In [46]:
# in this case the first value is the salary of the person with the first last_name in their department : Mr. Adams in Automotive, etc.
cmd = """SELECT department, last_name, salary, 
         FIRST_VALUE(salary) OVER (PARTITION BY department ORDER BY last_name)
         FROM staff"""
cur.execute(cmd)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

     department  last_name  salary  first_value
0    Automotive      Adams   79045        79045
1    Automotive  Alexander  144724        79045
2    Automotive   Anderson  126485        79045
3    Automotive  Armstrong   89969        79045
4    Automotive       Boyd   69936        79045
..          ...        ...     ...          ...
995        Toys    Stewart  148144        41855
996        Toys     Wagner  142516        41855
997        Toys    Wallace  118793        41855
998        Toys    Watkins  104444        41855
999        Toys      Welch   87422        41855

[1000 rows x 4 columns]

## RANK  
It helps to get the ranking for the order by value in each partition.  
Results are ordered both by the PARTITION BY AND ORDER BY values.

In [47]:
cmd = """SELECT department, last_name, salary, 
         RANK() OVER (PARTITION BY department ORDER BY salary DESC)
         FROM staff
      """
cur.execute(cmd)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

     department  last_name  salary  rank
0    Automotive    Sanchez  146167     1
1    Automotive  Alexander  144724     2
2    Automotive     George  141505     3
3    Automotive    Edwards  140194     4
4    Automotive     Gordon  136448     5
..          ...        ...     ...   ...
995        Toys     Austin   50161    37
996        Toys    Simpson   46444    38
997        Toys    Nichols   43537    39
998        Toys      Adams   41855    40
999        Toys       Long   40138    41

[1000 rows x 4 columns]

## LAG

Gives you the row before the processed row

In [48]:
cmd = """SELECT department, last_name, salary, 
         LAG(salary) OVER (PARTITION BY department ORDER BY            salary DESC)
         FROM staff"""
cur.execute(cmd)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

     department  last_name  salary       lag
0    Automotive    Sanchez  146167       NaN
1    Automotive  Alexander  144724  146167.0
2    Automotive     George  141505  144724.0
3    Automotive    Edwards  140194  141505.0
4    Automotive     Gordon  136448  140194.0
..          ...        ...     ...       ...
995        Toys     Austin   50161   54007.0
996        Toys    Simpson   46444   50161.0
997        Toys    Nichols   43537   46444.0
998        Toys      Adams   41855   43537.0
999        Toys       Long   40138   41855.0

[1000 rows x 4 columns]

## LEAD
Opposite of LAG. Second row to the first, third to the second, ... .

In [49]:
cmd = """SELECT department, last_name, salary, 
         LEAD(salary) OVER (PARTITION BY department ORDER BY          salary DESC)
         FROM staff"""
cur.execute(cmd)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

     department  last_name  salary      lead
0    Automotive    Sanchez  146167  144724.0
1    Automotive  Alexander  144724  141505.0
2    Automotive     George  141505  140194.0
3    Automotive    Edwards  140194  136448.0
4    Automotive     Gordon  136448  135326.0
..          ...        ...     ...       ...
995        Toys     Austin   50161   46444.0
996        Toys    Simpson   46444   43537.0
997        Toys    Nichols   43537   41855.0
998        Toys      Adams   41855   40138.0
999        Toys       Long   40138       NaN

[1000 rows x 4 columns]

## NTILE
Assigns buckets/bins to the values

In [50]:
cmd = """SELECT department, last_name, salary, 
         NTILE(4) OVER (PARTITION BY department ORDER BY          salary DESC)
         FROM staff"""
cur.execute(cmd)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

     department  last_name  salary  ntile
0    Automotive    Sanchez  146167      1
1    Automotive  Alexander  144724      1
2    Automotive     George  141505      1
3    Automotive    Edwards  140194      1
4    Automotive     Gordon  136448      1
..          ...        ...     ...    ...
995        Toys     Austin   50161      4
996        Toys    Simpson   46444      4
997        Toys    Nichols   43537      4
998        Toys      Adams   41855      4
999        Toys       Long   40138      4

[1000 rows x 4 columns]

In [51]:
cur.close()
conn.close()